Revit 2018 API
UIControlledApplication Properties
The UIControlledApplication type exposes the following members.
Properties
Name | Description
ActiveAddInId
 Get current active external application or external command id.
ControlledApplication
Returns the database level ControlledApplication represented by this UI-level ControlledApplication.
IsLateAddinLoading
 Indicates whether this add-in is loaded on the fly or not. If it is loaded when Revit is starting up, it is false, otherwise it should be true.
LoadedApplications
 Returns an array of successfully loaded external applications.
See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace